[
    {"id":1,"title":"Richard Dorment","description":"Richard Dorment is the editor in chief of Men’s Health, where he oversees all editorial content of the world’s largest men’s magazine across its print, web, social, and video platforms. Before joining Men’s Health in April 2018, he was an editor at Wired (where he focused on editing features on technology, science, culture, and business) as well as Esquire, where he","img":"https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/mh-rich-1569012166.png?crop=1xw:1xh;center,top&resize=480:*"},



    {"id":2,"title":"Ben Court","description":"Ben Court is an Executive Editor at Men’s Health. He has more than a decade of experience writing and editing stories about peak performance, as it relates to health, nutrition, fitness, fatherhood, weight loss, happiness, and sex and relationships. He’s a recovering soccer player and triathlete, and still enjoys yoga, cycling, running, swimming, lifting, grilling, and napping.","img":"https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/mh-ben-1568990961.png?crop=1xw:1xh;center,top&resize=480:*"},



    {"id":3,"title":"Mike Darling","description":"Mike Darling is an Executive Editor at Men’s Health. He was previously a senior editor on both the print and digital teams for six years, where he reported on and edited coverage around health and fitness, style and grooming, sex and relationships, and technology and gear. Prior to rejoining Men’s Health, he spent two years as the Managing Editor of Tonic, Vice Media’s health vertical.","img":"https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/mh-mike-1568990948.png?crop=1xw:1xh;center,top&resize=480:*"},



    {"id":4,"title":"Ben Paynter","description":"Ben Paynter is the Features Editor at Men's Health. He worked previously as a senior writer at Fast Company, senior editor at Men’s Health, and has written for Wired, Businessweek and The New York Times. He's earned a James Beard award for investigative reporting and had stories featured in annual anthologies of the best sports, food, and tech writing.","img":"https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/ben-paynter-1601664742.png?crop=1xw:1xh;center,top&resize=480:*"},


    {"id":5,"title":"Jordyn Taylor","description":"Jordyn Taylor is the Deputy Editor of Content at Men’s Health. She previously worked as a reporter and editor at Mic and the New York Observer, where she covered health and wellness, sex and relationships, entertainment, and other topics. Jordyn is an adjunct professor at New York University’s Arthur L. Carter Journalism Institute.","img":"https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/mh-jordyn-1568990915.png?crop=1xw:1xh;center,top&resize=480:*"},


    {"id":6,"title":"Spencer Dukoff","description":"Spencer Dukoff is the Deputy Editor of Content Strategy at Men's Health. He’s spent his career growing audiences at Mic, New York Daily News, Spoon University, and Slant, and has written for Forbes, Salon, Thrillist, and Columbia Journalism Review.","img":"https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/mh-spencer-1568990931.png?crop=1xw:1xh;center,top&resize=480:*"},




    {"id":7,"title":"Marty Munson","description":"Marty Munson is the Health Director for Men’s Health and has more than a decade of experience writing and editing health content for numerous publications including Marie Claire, Prevention, Real Simple, Triathlete, Dr. Oz the Good Life, and O, the Oprah magazine. She’s a marathon swimmer as well as a triathlon (USAT) and swim (USMS) coach.","img":"https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/mh-marty-1568990901.png?crop=1xw:1xh;center,top&resize=480:*"},


    {"id":8,"title":"Paul Kita","description":"Paul Kita is the James Beard Award-winning Food & Nutrition Editor at Men’s Health. He’s written two cookbooks: A Man, A Pan, A Plan (2017) and Guy Gourmet: Great Chefs’ Amazing Meals for a Lean & Healthy Body (2013). Paul has appeared on the Travel Channel and Fox & Friends, as well as numerous national radio and broadcast stations.","img":"https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/mh-paul-1568992635.png?crop=1xw:1xh;center,top&resize=480:*"},


    {"id":9,"title":"Josh Ocampo","description":"Josh Ocampo is a Senior Editor at Men's Health. He has previously worked at Men's Journal, Bon Appetit, Teen Vogue, and Mic, covering culture, politics, and breaking news, and has written for The New York Times and Huffington Post.","img":"https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/josh-ocampo-1601664820.png?crop=1xw:1xh;center,top&resize=480:*"},


    {"id":10,"title":"Ebenezer Samuel","description":"Ebenezer Samuel, C.S.C.S., is the Fitness Director of Men’s Health. He’s a certified trainer with more than 10 years of training experience and a diverse training background that includes bodybuilding, powerlifting, gymnastics, and performance training. He is the creator of Men’s Health’s New Rules of Muscle workout video program. Before arriving at Men’s Health, he spent several years as a national sports columnist for the New York Daily News, covering the NFL, NBA, and Major League Baseball.","img":"https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/mh-eb-1569012186.png?crop=1xw:1xh;center,top&resize=480:*"},


    {"id":11,"title":"Brett Williams","description":"Brett Williams is an Associate Fitness Editor at Men’s Health. He's a former pro football player and tech reporter who splits his workout time between strength and conditioning training, martial arts, and running. You can find his work elsewhere at Mashable, Thrillist, and other outlets","img":"https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/mh-brett-1568990844.png?crop=1xw:1xh;center,top&resize=480:*"},

    
    {"id":12,"title":"Melissa Matthews","description":"Melissa Matthews is a health writer at Men’s Health and has written for Newsweek, Men's Fitness, Inc. and Dr. Oz the Good Life. A health-conscious junk food enthusiast, she enjoys hiking, cake and attempting the latest fitness trend (to compensate for said sweet tooth).","img":"https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/melissa-1568995222.png?crop=1xw:1xh;center,top&resize=480:*"}

   
]